Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4CP16C_0.xml
        <register caption="Initialization Vector Register 1" name="AES_IVR1" offset="0x64" rw="W" size="4">
          <bitfield caption="Initialization Vector" mask="0xFFFFFFFF" name="IV"/>
        </register>
        <register caption="Initialization Vector Register 2" name="AES_IVR2" offset="0x68" rw="W" size="4">
          <bitfield caption="Initialization Vector" mask="0xFFFFFFFF" name="IV"/>
        </register>
        <register caption="Initialization Vector Register 3" name="AES_IVR3" offset="0x6C" rw="W" size="4">
          <bitfield caption="Initialization Vector" mask="0xFFFFFFFF" name="IV"/>
        </register>
        <register caption="Additional Authenticated Data Length Register" name="AES_AADLENR" offset="0x70" rw="RW" size="4">
          <bitfield caption="AAD Length" mask="0xFFFFFFFF" name="AADLEN"/>
        </register>
        <register caption="Plaintext/Ciphertext Length Register" name="AES_CLENR" offset="0x74" rw="RW" size="4">
          <bitfield caption="Plaintext/Ciphertext Length" mask="0xFFFFFFFF" name="CLEN"/>
        </register>
        <register caption="GCM Intermediate Hash Word Register 0" name="AES_GHASHR0" offset="0x78" rw="RW" size="4">
          <bitfield caption="Intermediate GCM Hash Word x" mask="0xFFFFFFFF" name="GHASH"/>
        </register>
        <register caption="GCM Intermediate Hash Word Register 1" name="AES_GHASHR1" offset="0x7C" rw="RW" size="4">
          <bitfield caption="Intermediate GCM Hash Word x" mask="0xFFFFFFFF" name="GHASH"/>
        </register>
        <register caption="GCM Intermediate Hash Word Register 2" name="AES_GHASHR2" offset="0x80" rw="RW" size="4">
          <bitfield caption="Intermediate GCM Hash Word x" mask="0xFFFFFFFF" name="GHASH"/>
        </register>
        <register caption="GCM Intermediate Hash Word Register 3" name="AES_GHASHR3" offset="0x84" rw="RW" size="4">
          <bitfield caption="Intermediate GCM Hash Word x" mask="0xFFFFFFFF" name="GHASH"/>
        </register>
        <register caption="GCM Authentication Tag Word Register 0" name="AES_TAGR0" offset="0x88" rw="R" size="4">
          <bitfield caption="GCM Authentication Tag x" mask="0xFFFFFFFF" name="TAG"/>
        </register>
        <register caption="GCM Authentication Tag Word Register 1" name="AES_TAGR1" offset="0x8C" rw="R" size="4">
          <bitfield caption="GCM Authentication Tag x" mask="0xFFFFFFFF" name="TAG"/>
        </register>
        <register caption="GCM Authentication Tag Word Register 2" name="AES_TAGR2" offset="0x90" rw="R" size="4">
          <bitfield caption="GCM Authentication Tag x" mask="0xFFFFFFFF" name="TAG"/>
        </register>
        <register caption="GCM Authentication Tag Word Register 3" name="AES_TAGR3" offset="0x94" rw="R" size="4">
          <bitfield caption="GCM Authentication Tag x" mask="0xFFFFFFFF" name="TAG"/>
        </register>
        <register caption="GCM Encryption Counter Value Register" name="AES_CTRR" offset="0x98" rw="R" size="4">
          <bitfield caption="GCM Encryption Counter" mask="0xFFFFFFFF" name="CTR"/>
        </register>
        <register caption="GCM H World Register 0" name="AES_GCMHR0" offset="0x9C" rw="RW" size="4">
          <bitfield caption="GCM H word x" mask="0xFFFFFFFF" name="H"/>
        </register>
        <register caption="GCM H World Register 1" name="AES_GCMHR1" offset="0xA0" rw="RW" size="4">
          <bitfield caption="GCM H word x" mask="0xFFFFFFFF" name="H"/>
        </register>
        <register caption="GCM H World Register 2" name="AES_GCMHR2" offset="0xA4" rw="RW" size="4">
          <bitfield caption="GCM H word x" mask="0xFFFFFFFF" name="H"/>
        </register>
        <register caption="GCM H World Register 3" name="AES_GCMHR3" offset="0xA8" rw="RW" size="4">
          <bitfield caption="GCM H word x" mask="0xFFFFFFFF" name="H"/>
        </register>
        <register caption="Receive Pointer Register" name="AES_RPR" offset="0x100" rw="RW" size="4">
          <bitfield caption="Receive Pointer Register" mask="0xFFFFFFFF" name="RXPTR"/>
        </register>
        <register caption="Receive Counter Register" name="AES_RCR" offset="0x104" rw="RW" size="4">
          <bitfield caption="Receive Counter Register" mask="0x0000FFFF" name="RXCTR"/>
        </register>
        <register caption="Transmit Pointer Register" name="AES_TPR" offset="0x108" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0xFFFFFFFF" name="TXPTR"/>
        </register>
        <register caption="Transmit Counter Register" name="AES_TCR" offset="0x10C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0x0000FFFF" name="TXCTR"/>
        </register>
        <register caption="Receive Next Pointer Register" name="AES_RNPR" offset="0x110" rw="RW" size="4">
          <bitfield caption="Receive Next Pointer" mask="0xFFFFFFFF" name="RXNPTR"/>
        </register>
        <register caption="Receive Next Counter Register" name="AES_RNCR" offset="0x114" rw="RW" size="4">
          <bitfield caption="Receive Next Counter" mask="0x0000FFFF" name="RXNCTR"/>
        </register>
        <register caption="Transmit Next Pointer Register" name="AES_TNPR" offset="0x118" rw="RW" size="4">
          <bitfield caption="Transmit Next Pointer" mask="0xFFFFFFFF" name="TXNPTR"/>
        </register>
        <register caption="Transmit Next Counter Register" name="AES_TNCR" offset="0x11C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Next" mask="0x0000FFFF" name="TXNCTR"/>
        </register>
        <register caption="Transfer Control Register" name="AES_PTCR" offset="0x120" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
        </register>
        <register caption="Transfer Status Register" name="AES_PTSR" offset="0x124" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
        </register>
      </register-group>
      <value-group caption="" name="AES_MR__DUALBUFF">
        <value caption="AES_IDATARx cannot be written during processing of previous block." name="INACTIVE" value="0x0"/>
        <value caption="AES_IDATARx can be written during processing of previous block when SMOD = 0x2. It speeds up the overall runtime of large files." name="ACTIVE" value="0x1"/>
      </value-group>
      <value-group caption="" name="AES_MR__SMOD">
        <value caption="Manual Mode" name="MANUAL_START" value="0x0"/>
        <value caption="Auto Mode" name="AUTO_START" value="0x1"/>
        <value caption="AES_IDATAR0 access only Auto Mode" name="IDATAR0_START" value="0x2"/>
      </value-group>
