Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4CP16C_0.xml
        <register caption="Supply Controller Status Register" name="SUPC_SR" offset="0x14" rw="R" size="4">
          <bitfield caption="FWUP Wake-up Status" mask="0x00000001" name="FWUPS" values="SUPC_SR__FWUPS"/>
          <bitfield caption="WKUP Wake-up Status" mask="0x00000002" name="WKUPS" values="SUPC_SR__WKUPS"/>
          <bitfield caption="Supply Monitor Detection Wake-up Status" mask="0x00000004" name="SMWS" values="SUPC_SR__SMWS"/>
          <bitfield caption="Brownout Detector Reset Status" mask="0x00000008" name="BODRSTS" values="SUPC_SR__BODRSTS"/>
          <bitfield caption="Supply Monitor Reset Status" mask="0x00000010" name="SMRSTS" values="SUPC_SR__SMRSTS"/>
          <bitfield caption="Supply Monitor Status" mask="0x00000020" name="SMS" values="SUPC_SR__SMS"/>
          <bitfield caption="Supply Monitor Output Status" mask="0x00000040" name="SMOS" values="SUPC_SR__SMOS"/>
          <bitfield caption="32 kHz Oscillator Selection Status" mask="0x00000080" name="OSCSEL" values="SUPC_SR__OSCSEL"/>
          <bitfield caption="LCD Status" mask="0x00000100" name="LCDS" values="SUPC_SR__LCDS"/>
          <bitfield caption="Low Power Debouncer Tamper Status on WKUP14/TMP2" mask="0x00000200" name="LPDBCS2" values="SUPC_SR__LPDBCS2"/>
          <bitfield caption="Low Power Debouncer Tamper Status on WKUP15/TMP3" mask="0x00000400" name="LPDBCS3" values="SUPC_SR__LPDBCS3"/>
          <bitfield caption="FWUP Input Status" mask="0x00001000" name="FWUPIS" values="SUPC_SR__FWUPIS"/>
          <bitfield caption="Low Power Debouncer Wake-up Status on WKUP0/TMP0" mask="0x00002000" name="LPDBCS0" values="SUPC_SR__LPDBCS0"/>
          <bitfield caption="Low Power Debouncer Wake-up Status on WKUP10/TMP1" mask="0x00004000" name="LPDBCS1" values="SUPC_SR__LPDBCS1"/>
          <bitfield caption="Backup Area Power-On Reset Status" mask="0x00008000" name="BUPPORS" values="SUPC_SR__BUPPORS"/>
          <bitfield caption="WKUPx Input Status" mask="0x00010000" name="WKUPIS0" values="SUPC_SR__WKUPIS0"/>
          <bitfield caption="WKUPx Input Status" mask="0x00020000" name="WKUPIS1" values="SUPC_SR__WKUPIS1"/>
          <bitfield caption="WKUPx Input Status" mask="0x00040000" name="WKUPIS2" values="SUPC_SR__WKUPIS2"/>
          <bitfield caption="WKUPx Input Status" mask="0x00080000" name="WKUPIS3" values="SUPC_SR__WKUPIS3"/>
          <bitfield caption="WKUPx Input Status" mask="0x00100000" name="WKUPIS4" values="SUPC_SR__WKUPIS4"/>
          <bitfield caption="WKUPx Input Status" mask="0x00200000" name="WKUPIS5" values="SUPC_SR__WKUPIS5"/>
          <bitfield caption="WKUPx Input Status" mask="0x00400000" name="WKUPIS6" values="SUPC_SR__WKUPIS6"/>
          <bitfield caption="WKUPx Input Status" mask="0x00800000" name="WKUPIS7" values="SUPC_SR__WKUPIS7"/>
          <bitfield caption="WKUPx Input Status" mask="0x01000000" name="WKUPIS8" values="SUPC_SR__WKUPIS8"/>
          <bitfield caption="WKUPx Input Status" mask="0x02000000" name="WKUPIS9" values="SUPC_SR__WKUPIS9"/>
          <bitfield caption="WKUPx Input Status" mask="0x04000000" name="WKUPIS10" values="SUPC_SR__WKUPIS10"/>
          <bitfield caption="WKUPx Input Status" mask="0x08000000" name="WKUPIS11" values="SUPC_SR__WKUPIS11"/>
          <bitfield caption="WKUPx Input Status" mask="0x10000000" name="WKUPIS12" values="SUPC_SR__WKUPIS12"/>
          <bitfield caption="WKUPx Input Status" mask="0x20000000" name="WKUPIS13" values="SUPC_SR__WKUPIS13"/>
          <bitfield caption="WKUPx Input Status" mask="0x40000000" name="WKUPIS14" values="SUPC_SR__WKUPIS14"/>
          <bitfield caption="WKUPx Input Status" mask="0x80000000" name="WKUPIS15" values="SUPC_SR__WKUPIS15"/>
        </register>
      </register-group>
      <value-group caption="" name="SUPC_CR__VROFF">
        <value caption="No effect." name="NO_EFFECT" value="0"/>
        <value caption="If KEY is correct, asserts the system reset signal and stops the voltage regulator." name="STOP_VREG" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_CR__XTALSEL">
        <value caption="No effect." name="NO_EFFECT" value="0"/>
        <value caption="If KEY is correct, switches the slow clock on the crystal oscillator output." name="CRYSTAL_SEL" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_CR__KEY">
        <value caption="Writing any other value in this field aborts the write operation." name="PASSWD" value="0xA5"/>
      </value-group>
      <value-group caption="" name="SUPC_SMMR__SMSMPL">
        <value caption="Supply Monitor disabled" name="SMD" value="0x0"/>
        <value caption="Continuous Supply Monitor" name="CSM" value="0x1"/>
        <value caption="Supply Monitor enabled one SLCK period every 32 SLCK periods" name="_32SLCK" value="0x2"/>
        <value caption="Supply Monitor enabled one SLCK period every 256 SLCK periods" name="_256SLCK" value="0x3"/>
        <value caption="Supply Monitor enabled one SLCK period every 2,048 SLCK periods" name="_2048SLCK" value="0x4"/>
      </value-group>
      <value-group caption="" name="SUPC_SMMR__SMRSTEN">
        <value caption="The system reset signal is not affected when a supply monitor detection occurs." name="NOT_ENABLE" value="0"/>
        <value caption="The system reset signal is asserted when a supply monitor detection occurs." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SMMR__SMIEN">
        <value caption="The SUPC interrupt signal is not affected when a supply monitor detection occurs." name="NOT_ENABLE" value="0"/>
        <value caption="The SUPC interrupt signal is asserted when a supply monitor detection occurs." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_MR__LCDMODE">
        <value caption="The internal supply source and the external supply source are both deselected (OFF Mode)." name="LCDOFF" value="0x0"/>
        <value caption="The external supply source for LCD (VDDLCD) is selected (the LCD voltage regulator is in Hi-Z Mode)." name="LCDON_EXTVR" value="0x2"/>
        <value caption="The internal supply source for LCD (the LCD Voltage Regulator) is selected (Active Mode)." name="LCDON_INVR" value="0x3"/>
      </value-group>
      <value-group caption="" name="SUPC_MR__BODRSTEN">
        <value caption="The system reset signal is not affected when a brownout detection occurs." name="NOT_ENABLE" value="0"/>
        <value caption="The system reset signal is asserted when a brownout detection occurs." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_MR__BODDIS">
        <value caption="The core brownout detector is enabled." name="ENABLE" value="0"/>
        <value caption="The core brownout detector is disabled." name="DISABLE" value="1"/>
      </value-group>
